# pyspark session

In [1]:
import pyspark

In [4]:
from pyspark.sql import SparkSession

In [6]:
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [9]:
df_spark=spark.read.csv('income1.csv',header=True,inferSchema=True)

In [10]:
df_spark.show()

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

# Dropping columns

In [11]:
df_spark.drop('Name').show()

+----+----------+---------+
| Age|Experience|Income($)|
+----+----------+---------+
|  27|         1|    70000|
|  29|         2|    90000|
|  29|         3|    61000|
|  28|        10|    60000|
|  42|         1|   150000|
|  39|         1|   155000|
|  41|         1|   160000|
|  38|         1|   162000|
|  36|        11|   156000|
|  35|         1|   130000|
|  37|        19|   137000|
|  26|         1|    45000|
|  27|         1|    48000|
|  28|         1|    51000|
|null|      null|    49500|
|  32|         1|    53000|
|  40|         1|    65000|
|  41|         1|    63000|
|  43|         1|    64000|
|  39|         1|    80000|
+----+----------+---------+
only showing top 20 rows

In [12]:
df_spark.show()

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

In [14]:
df_spark.na.drop().show() # wherever null values, that rows are removed

+--------+---+----------+---------+
|    Name|Age|Experience|Income($)|
+--------+---+----------+---------+
|     Rob| 27|         1|    70000|
| Michael| 29|         2|    90000|
|   Mohan| 29|         3|    61000|
|  Ismail| 28|        10|    60000|
|    Kory| 42|         1|   150000|
|  Gautam| 39|         1|   155000|
|   David| 41|         1|   160000|
|  Andrea| 38|         1|   162000|
|    Brad| 36|        11|   156000|
|Angelina| 35|         1|   130000|
|  Donald| 37|        19|   137000|
|     Tom| 26|         1|    45000|
|  Arnold| 27|         1|    48000|
|   Jared| 28|         1|    51000|
|  Ranbir| 32|         1|    53000|
|  Dipika| 40|         1|    65000|
|    Nick| 43|         1|    64000|
|    Alia| 39|         1|    80000|
|   Abdul| 39|         1|    58000|
+--------+---+----------+---------+

In [17]:
df_spark.na.drop(how='any').show() #how=null,any

+--------+---+----------+---------+
|    Name|Age|Experience|Income($)|
+--------+---+----------+---------+
|     Rob| 27|         1|    70000|
| Michael| 29|         2|    90000|
|   Mohan| 29|         3|    61000|
|  Ismail| 28|        10|    60000|
|    Kory| 42|         1|   150000|
|  Gautam| 39|         1|   155000|
|   David| 41|         1|   160000|
|  Andrea| 38|         1|   162000|
|    Brad| 36|        11|   156000|
|Angelina| 35|         1|   130000|
|  Donald| 37|        19|   137000|
|     Tom| 26|         1|    45000|
|  Arnold| 27|         1|    48000|
|   Jared| 28|         1|    51000|
|  Ranbir| 32|         1|    53000|
|  Dipika| 40|         1|    65000|
|    Nick| 43|         1|    64000|
|    Alia| 39|         1|    80000|
|   Abdul| 39|         1|    58000|
+--------+---+----------+---------+

In [18]:
df_spark.na.drop(how='any',thresh=2).show() #drop the rows if the null values greater than 2

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

In [20]:
df_spark.na.drop(how='any',thresh=1).show()

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

In [21]:
df_spark.na.drop(how='any',subset=['Experience']).show() # remove the rows if null values in experience

+--------+---+----------+---------+
|    Name|Age|Experience|Income($)|
+--------+---+----------+---------+
|     Rob| 27|         1|    70000|
| Michael| 29|         2|    90000|
|   Mohan| 29|         3|    61000|
|  Ismail| 28|        10|    60000|
|    Kory| 42|         1|   150000|
|  Gautam| 39|         1|   155000|
|   David| 41|         1|   160000|
|  Andrea| 38|         1|   162000|
|    Brad| 36|        11|   156000|
|Angelina| 35|         1|   130000|
|  Donald| 37|        19|   137000|
|     Tom| 26|         1|    45000|
|  Arnold| 27|         1|    48000|
|   Jared| 28|         1|    51000|
|  Ranbir| 32|         1|    53000|
|  Dipika| 40|         1|    65000|
|    null| 41|         1|    63000|
|    Nick| 43|         1|    64000|
|    Alia| 39|         1|    80000|
|   Abdul| 39|         1|    58000|
+--------+---+----------+---------+

In [22]:
df_spark.na.drop(how='any',subset=['Age']).show()

+--------+---+----------+---------+
|    Name|Age|Experience|Income($)|
+--------+---+----------+---------+
|     Rob| 27|         1|    70000|
| Michael| 29|         2|    90000|
|   Mohan| 29|         3|    61000|
|  Ismail| 28|        10|    60000|
|    Kory| 42|         1|   150000|
|  Gautam| 39|         1|   155000|
|   David| 41|         1|   160000|
|  Andrea| 38|         1|   162000|
|    Brad| 36|        11|   156000|
|Angelina| 35|         1|   130000|
|  Donald| 37|        19|   137000|
|     Tom| 26|         1|    45000|
|  Arnold| 27|         1|    48000|
|   Jared| 28|         1|    51000|
|  Ranbir| 32|         1|    53000|
|  Dipika| 40|         1|    65000|
|    null| 41|         1|    63000|
|    Nick| 43|         1|    64000|
|    Alia| 39|         1|    80000|
|    null| 41|      null|     null|
+--------+---+----------+---------+
only showing top 20 rows

# Filling Missing values

In [25]:
df_spark.na.fill('Missing','Experience').show()

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

In [28]:
df_spark.na.fill('Missing',['Experience','Age']).show()

+--------+----+----------+---------+
|    Name| Age|Experience|Income($)|
+--------+----+----------+---------+
|     Rob|  27|         1|    70000|
| Michael|  29|         2|    90000|
|   Mohan|  29|         3|    61000|
|  Ismail|  28|        10|    60000|
|    Kory|  42|         1|   150000|
|  Gautam|  39|         1|   155000|
|   David|  41|         1|   160000|
|  Andrea|  38|         1|   162000|
|    Brad|  36|        11|   156000|
|Angelina|  35|         1|   130000|
|  Donald|  37|        19|   137000|
|     Tom|  26|         1|    45000|
|  Arnold|  27|         1|    48000|
|   Jared|  28|         1|    51000|
|   Stark|null|      null|    49500|
|  Ranbir|  32|         1|    53000|
|  Dipika|  40|         1|    65000|
|    null|  41|         1|    63000|
|    Nick|  43|         1|    64000|
|    Alia|  39|         1|    80000|
+--------+----+----------+---------+
only showing top 20 rows

In [30]:
# imputer function

from pyspark.ml.feature import Imputer
imp=Imputer(inputCols=['Age','Experience'],
        outputCols=["{}_imputed".format(c) for c in ['Age','Experience']]
       ).setStrategy("median")

In [31]:
imp.fit(df_spark).transform(df_spark).show()

+--------+----+----------+---------+-----------+------------------+
|    Name| Age|Experience|Income($)|Age_imputed|Experience_imputed|
+--------+----+----------+---------+-----------+------------------+
|     Rob|  27|         1|    70000|         27|                 1|
| Michael|  29|         2|    90000|         29|                 2|
|   Mohan|  29|         3|    61000|         29|                 3|
|  Ismail|  28|        10|    60000|         28|                10|
|    Kory|  42|         1|   150000|         42|                 1|
|  Gautam|  39|         1|   155000|         39|                 1|
|   David|  41|         1|   160000|         41|                 1|
|  Andrea|  38|         1|   162000|         38|                 1|
|    Brad|  36|        11|   156000|         36|                11|
|Angelina|  35|         1|   130000|         35|                 1|
|  Donald|  37|        19|   137000|         37|                19|
|     Tom|  26|         1|    45000|         26|                 1|
|  Arnold|  27|         1|    48000|         27|                 1|
|   Jared|  28|         1|    51000|         28|                 1|
|   Stark|null|      null|    49500|         37|                 1|
|  Ranbir|  32|         1|    53000|         32|                 1|
|  Dipika|  40|         1|    65000|         40|                 1|
|    null|  41|         1|    63000|         41|                 1|
|    Nick|  43|         1|    64000|         43|                 1|
|    Alia|  39|         1|    80000|         39|                 1|
+--------+----+----------+---------+-----------+------------------+
only showing top 20 rows